app/controllers/api/tracks_controller.rb

    def index
        @tracks = Track.all
---
SELECT "tracks".* FROM "tracks"