app/views/api/artists/show.json.jbuilder


@artist.albums.includes(:artist).each do |album|
---
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 38]]