app/views/api/albums/show.json.jbuilder


@album.tracks.includes(:album).each do |track|
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 66]]