app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.base64(64)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "8hYn3RxdRdzqWPpMfA3YCVGvWbpi1fGnnux1ppkvl58IvwrzATDbj+avA3mvJmIZZ6K+3EpOCZduboap3LUQPw=="], ["updated_at", "2020-04-07 15:51:50.287405"], ["id", 3]]